v2206/atmospheric_Microclimate/streetCanyon_CFDHAM_veg/constant/Idif
(
(	0	0	)
(	3600	0	)
(	7200	0	)
(	10800	0	)
(	14400	0	)
(	18000	5.31060353557864	)
(	21600	57.1708382378482	)
(	25200	85.1267966941423	)
(	28800	99.5222494277647	)
(	32400	107.660727322296	)
(	36000	112.438858773488	)
(	39600	115.134158346424	)
(	43200	116.336636682838	)
(	46800	116.280405551532	)
(	50400	114.954909209726	)
(	54000	112.100175923773	)
(	57600	107.081945475799	)
(	61200	98.5278172273936	)
(	64800	83.298940828053	)
(	68400	53.4245960294729	)
(	72000	2.05559351366297	)
(	75600	0	)
(	79200	0	)
(	82800	0	)
(	86400	0	)
)
