v2206/atmospheric_Microclimate/streetCanyon_CFDHAM_veg/0/air.bckp/LAD
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      LAD;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            slip;
    }
    ground
    {
        type            zeroGradient;
    }
    air_to_street
    {
        type            zeroGradient;
    }
    air_to_windward
    {
        type            zeroGradient;
    }
    air_to_leeward
    {
        type            zeroGradient;
    }
    side1
    {
        type            slip;
    }
    side2
    {
        type            slip;
    }
    buildings
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
